fix: moved ascii to mermaid
